GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
	while( len )
	{
		if( fstuff )
		{
			*pdst	= *psrc + 0x7c;
			fstuff	= 0;
			count++;
			fcs ^= *pdst;
		} else
		{
			if( *psrc == 0x7d )
			{
				fstuff = 1;
			} else
			{
				*pdst	= *psrc;
				fcs		^= *pdst;
				count++;
			}
		}
		psrc++;
		pdst++;
		len--;
	}
	if( fcs != 0 )
	{
		rt_kprintf( "%s>fcs error\r\n", __func__ );
		return 0;
	}
	rt_kprintf( "count=%d\r\n", count );
	return count;
}

#if 0
/**添加一个字节**/
static uint16_t jt808_pack_byte( uint8_t * buf, uint8_t * fcs, uint8_t data )
{
	uint8_t * p = buf;
	*fcs ^= data;
	if( ( data == 0x7d ) || ( data == 0x7e ) )
	{
		*p++	= 0x7d;
		*p		= ( data - 0x7c );
		return 2;
	} else
	{
		*p = data;
		return 1;
	}
}

/*传递进长度，便于计算*/
static uint16_t jt808_pack_int( uint8_t * buf, uint8_t * fcs, uint32_t data, uint8_t width )
{
	uint16_t count = 0;
	switch( width )
	{
		case 1:
			count += jt808_pack_byte( buf + count, fcs, ( data & 0xff ) );
			break;
		case 2:
			count	+= jt808_pack_byte( buf + count, fcs, ( data >> 8 ) );
			count	+= jt808_pack_byte( buf + count, fcs, ( data & 0xff ) );
			break;
		case 4:
			count	+= jt808_pack_byte( buf + count, fcs, ( data >> 24 ) );
			count	+= jt808_pack_byte( buf + count, fcs, ( data >> 16 ) );
			count	+= jt808_pack_byte( buf + count, fcs, ( data >> 8 ) );
			count	+= jt808_pack_byte( buf + count, fcs, ( data & 0xff ) );
			break;
	}
	return count;
}

/*添加字符串***/
static uint16_t jt808_pack_string( uint8_t * buf, uint8_t * fcs, char * str )
{
	uint16_t	count	= 0;
	char		* p		= str;
	while( *p )
	{
		count += jt808_pack_byte( buf + count, fcs, *p++ );
	}
	return count;
}

/**添加数组**/
static uint16_t jt808_pack_array( uint8_t * buf, uint8_t * fcs, uint8_t * src, uint16_t len )
{
	uint16_t	count = 0;
	int			i;
	char		* p = src;
	for( i = 0; i < len; i++ )
	{
		count += jt808_pack_byte( buf + count, fcs, *p++ );
	}
	return count;
}

#endif


/*
   jt808终端发送信息
   并将相关信息注册到接收信息的处理线程中
   需要传递消息ID,和消息体，由jt808_send线程完成
    消息的填充
    发送和重发机制
    流水号
    已发信息的回收free
   传递进来的格式
   <msgid 2bytes><msg_len 2bytes><msgbody nbytes>

 */
static void jt808_send( void * parameter )
{
}

/*
发送后收到应答处理
*/
void jt808_tx_response( uint8_t linkno, uint8_t *pmsg )
{
	uint8_t		* msg = pmsg + 12;
	uint16_t	id;
	uint16_t	seq;
	uint8_t		res;

	seq = ( *msg << 8 ) | *( msg + 1 );
	id	= ( *( msg + 2 ) << 8 ) | *( msg + 3 );
	res = *( msg + 4 );

	rt_kprintf( "%d>CENT_ACK id=%04x seq=%04x res=%d\r\n", rt_tick_get( ), id, seq, res );
	switch( id )        // 判断对应终端消息的ID做区分处理
	{
		case 0x0200:    //	对应位置消息的应答
			rt_kprintf( "\r\nCentre ACK!\r\n" );
			break;
		case 0x0002:    //	心跳包的应答
			rt_kprintf( "\r\nCentre  Heart ACK!\r\n" );
			break;
		case 0x0101:    //	终端注销应答
			break;
		case 0x0102:    //	终端鉴权
			rt_kprintf( "\r\nCentre Auth ACK!\r\n" );
			break;
		case 0x0800:    // 多媒体事件信息上传
			break;
		case 0x0702:
			rt_kprintf( "\r\n  驾驶员信息上报---中心应答!  \r\n" );
			break;
		case 0x0701:
			rt_kprintf( "\r\n	电子运单上报---中心应答!  \r\n");
			break;
		default:
			rt_kprintf( "\r\nunknown id=%04x\r\n", id );
			break;
	}
}

/*
   消息发送超时
 */
static rt_err_t jt808_tx_timeout( JT808_TX_NODEDATA * nodedata )
{
	rt_kprintf( "tx timeout\r\n" );
}

/*
   添加一个信息到发送列表中
   uint8_t linkno, 发送使用的socket号  1:808 2:iccar 3:user_define
   JT808_MSG_TYPE type, 类型 终端上报还是应答
   uint16_t id, 消息头中的消息ID
   uint16_t attr, 消息头中的消息体属性
   int32_t seq,  消息头中的流水号 -1:使用内部发送递增的  0-0XFFFF:指定流水号
   uint8_t *pinfo, 消息体
   对于多包发送的消息头中的消息包封装项字段，放到消息体中
 */
rt_err_t jt808_add_tx_data( uint8_t linkno,
                            JT808_MSG_TYPE type,
                            uint16_t id,
                            uint16_t attr,
                            int32_t seq,
                            void ( *cb_tx_timeout )( ),
                            void ( *cb_tx_response )( ),
                            uint8_t *pinfo )
{
	uint8_t				* pdata;
	JT808_TX_NODEDATA	* pnodedata;
	uint16_t			len;

	len = attr & 0xFFF;
	/**/

	pnodedata = rt_malloc( sizeof( JT808_TX_NODEDATA ) + sizeof( JT808_MSG_HEAD ) + len );
	if( pnodedata == RT_NULL )
	{
		return -RT_ERROR;
	}
	pnodedata->linkno	= linkno;
	pnodedata->type		= type;
	pnodedata->state	= IDLE;
	pnodedata->retry	= 0;
	if( attr & 0x2000 )
	{
		pnodedata->multipacket = 1;
	} else
	{
		pnodedata->multipacket = 0;
	}

	if( cb_tx_timeout == RT_NULL )
	{
		pnodedata->cb_tx_timeout = jt808_tx_timeout;
	} else
	{
		pnodedata->cb_tx_timeout = cb_tx_timeout;
	}
	if( cb_tx_response == RT_NULL )
	{
		pnodedata->cb_tx_response = jt808_tx_response;
	} else
	{
		pnodedata->cb_tx_response = cb_tx_timeout;
	}
/*在此可以存储在上报*/

/*在这添加上报的记录头*/
	pnodedata->msg_len = len + sizeof( JT808_MSG_HEAD );
	if( seq == -1 )
	{
		pnodedata->head_sn = tx_seq;
		tx_seq++;
	} else
	{
		pnodedata->head_sn = seq;
	}

	pnodedata->head_id = id;

	pdata		= pnodedata->tag_data;
	*pdata++	= id >> 8;
	*pdata++	= id & 0xff;
	*pdata++	= attr >> 8;
	*pdata++	= attr & 0xff;
	memcpy( pdata, mobile, 6 );
	pdata		+= 6;
	*pdata++	= pnodedata->head_sn >> 8;
	*pdata++	= pnodedata->head_sn & 0xff;
	memcpy( pdata, pinfo, len );    /*填充用户数据*/
	msglist_append( list_jt808_tx, pnodedata );

	return pnodedata->head_sn;      /*返回发送包序号*/
}

/*
   终端通用应答
 */
static rt_err_t jt808_tx_0x0001( uint8_t linkno, uint16_t seq, uint16_t id, uint8_t res )
{
	uint8_t				* pdata;
	JT808_TX_NODEDATA	* pnodedata;
	uint8_t				buf [256];
	uint8_t				* p;
	uint16_t			len;

	pnodedata = rt_malloc( sizeof( JT808_TX_NODEDATA ) );
	if( pnodedata == NULL )
	{
		return -RT_ERROR;
	}
	pnodedata->type				= TERMINAL_ACK;
	pnodedata->state			= IDLE;
	pnodedata->retry			= 0;
	pnodedata->cb_tx_timeout	= jt808_tx_timeout;
	pnodedata->cb_tx_response	= jt808_tx_response;

	pdata = rt_malloc( 5 + 12 );
	if( pdata == NULL )
	{
		rt_free( pnodedata );
		return -RT_ERROR;
	}

//	jt808_add_msg_head(pdata,0x0001,0x0005);
	p		= pdata + 12;
	*p++	= ( seq >> 8 );
	*p++	= ( seq & 0xff );
	*p++	= ( id >> 8 );
	*p++	= ( id & 0xff );
	*p		= res;

	pnodedata->msg_len = len;
	msglist_append( list_jt808_tx, pnodedata );
	tx_seq++;
}

/*
   平台通用应答,收到信息，停止发送
 */
static int handle_rx_0x8001( uint8_t linkno, uint8_t *pmsg )
{
	MsgListNode			* iter;
	JT808_TX_NODEDATA	* iterdata;

	uint16_t			id;
	uint16_t			seq;
	uint8_t				res;
/*跳过消息头12byte*/
	seq = ( *( pmsg + 12 ) << 8 ) | *( pmsg + 13 );
	id	= ( *( pmsg + 14 ) << 8 ) | *( pmsg + 15 );
	res = *( pmsg + 16 );

	/*单条处理*/
	iter		= list_jt808_tx->first;
	iterdata	= (JT808_TX_NODEDATA*)iter->data;
	if( ( iterdata->head_id == id ) && ( iterdata->head_sn == seq ) )
	{
		iterdata->cb_tx_response( linkno, pmsg ); /*应答处理函数*/
		iterdata->state = ACK_OK;
	}
}

/*补传分包请求*/
static int handle_rx_0x8003( uint8_t linkno, uint8_t *pmsg )
{
}

/* 监控中心对终端注册消息的应答*/
static int handle_rx_0x8100( uint8_t linkno, uint8_t *pmsg )
{
	MsgListNode			* iter;
	JT808_TX_NODEDATA	* iterdata;

	uint16_t			body_len; /*消息体长度*/
	uint16_t			ack_seq;
	uint8_t				res;
	uint8_t				* msg;

	body_len	= ( ( *( pmsg + 2 ) << 8 ) | ( *( pmsg + 3 ) ) ) & 0x3FF;
	msg			= pmsg + 12;

