GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
#define DECL_JT808_RX_HANDLE( a )	{ a, handle_rx_ ## a }
#define DECL_JT808_TX_HANDLE( a )	{ a, handle_jt808_tx_ ## a }

HANDLE_JT808_RX_MSG handle_rx_msg[] =
{
	DECL_JT808_RX_HANDLE( 0x8001 ), //	通用应答
	DECL_JT808_RX_HANDLE( 0x8003 ), //	补传分包请求
	DECL_JT808_RX_HANDLE( 0x8100 ), //  监控中心对终端注册消息的应答
	DECL_JT808_RX_HANDLE( 0x8103 ), //	设置终端参数
	DECL_JT808_RX_HANDLE( 0x8104 ), //	查询终端参数
	DECL_JT808_RX_HANDLE( 0x8105 ), // 终端控制
	DECL_JT808_RX_HANDLE( 0x8106 ), // 查询指定终端参数
	DECL_JT808_RX_HANDLE( 0x8201 ), // 位置信息查询    位置信息查询消息体为空
	DECL_JT808_RX_HANDLE( 0x8202 ), // 临时位置跟踪控制
	DECL_JT808_RX_HANDLE( 0x8300 ), //	文本信息下发
	DECL_JT808_RX_HANDLE( 0x8301 ), //	事件设置
	DECL_JT808_RX_HANDLE( 0x8302 ), // 提问下发
	DECL_JT808_RX_HANDLE( 0x8303 ), //	信息点播菜单设置
	DECL_JT808_RX_HANDLE( 0x8304 ), //	信息服务
	DECL_JT808_RX_HANDLE( 0x8400 ), //	电话回拨
	DECL_JT808_RX_HANDLE( 0x8401 ), //	设置电话本
	DECL_JT808_RX_HANDLE( 0x8500 ), //	车辆控制
	DECL_JT808_RX_HANDLE( 0x8600 ), //	设置圆形区域
	DECL_JT808_RX_HANDLE( 0x8601 ), //	删除圆形区域
	DECL_JT808_RX_HANDLE( 0x8602 ), //	设置矩形区域
	DECL_JT808_RX_HANDLE( 0x8603 ), //	删除矩形区域
	DECL_JT808_RX_HANDLE( 0x8604 ), //	多边形区域
	DECL_JT808_RX_HANDLE( 0x8605 ), //	删除多边区域
	DECL_JT808_RX_HANDLE( 0x8606 ), //	设置路线
	DECL_JT808_RX_HANDLE( 0x8607 ), //	删除路线
	DECL_JT808_RX_HANDLE( 0x8700 ), //	行车记录仪数据采集命令
	DECL_JT808_RX_HANDLE( 0x8701 ), //	行驶记录仪参数下传命令
	DECL_JT808_RX_HANDLE( 0x8800 ), //	多媒体数据上传应答
	DECL_JT808_RX_HANDLE( 0x8801 ), //	摄像头立即拍照
	DECL_JT808_RX_HANDLE( 0x8802 ), //	存储多媒体数据检索
	DECL_JT808_RX_HANDLE( 0x8803 ), //	存储多媒体数据上传命令
	DECL_JT808_RX_HANDLE( 0x8804 ), //	录音开始命令
	DECL_JT808_RX_HANDLE( 0x8805 ), //	单条存储多媒体数据检索上传命令 ---- 补充协议要求
	DECL_JT808_RX_HANDLE( 0x8900 ), //	数据下行透传
	DECL_JT808_RX_HANDLE( 0x8A00 ), //	平台RSA公钥
};

/*jt808的socket管理

   维护链路。会有不同的原因
   上报状态的维护
   1.尚未登网
   2.中心连接，DNS,超时不应答
   3.禁止上报，关闭模块的区域
   4.当前正在进行空中更新，多媒体上报等不需要打断的工作

 */
/*
   这个回调主要是M66的链路关断时的通知，socket不是一个完整的线程
 */
void cb_socket_close( uint8_t cid)
{
	if( cid == 1 )
	{
		connect_state.server_state = CONNECT_CLOSE;
	}

	if( cid == 2 )
	{
		connect_state.auth_state = CONNECT_CLOSE;
	}
}

/*
   接收处理
   分析jt808格式的数据
   <linkno><长度2byte><标识0x7e><消息头><消息体><校验码><标识0x7e>

 */
uint16_t jt808_rx_proc( uint8_t * pinfo )
{
	uint8_t		* psrc;
	uint16_t	len;
	uint8_t		linkno;
	uint16_t	i, id;
	uint8_t		flag_find	= 0;
	uint8_t		fcs			= 0;
	uint16_t	ret;

	linkno	= pinfo [0];
	len		= ( pinfo [1] << 8 ) | pinfo [2];

/*去转义，还是直接在pinfo上操作*/
	len = jt808_decode_fcs( pinfo + 3, len );
	if( len == 0 )
	{
		rt_kprintf( ">jt808_decode_fcs error\r\n" );
		return 1;
	}
/*显示解码后的信息*/
	rt_kprintf( "\r\n>dump start(%d)\r\nhead>", len );
	psrc = pinfo + 3; /*跳过前面的len和0x7e*/
	rt_kprintf( "%02x%02x ", *( psrc + 0 ), *( psrc + 1 ) );
	rt_kprintf( "%02x%02x ", *( psrc + 2 ), *( psrc + 3 ) );
	for( i = 0; i < 6; i++ )
	{
		rt_kprintf( "%02x", *( psrc + 4 + i ) );
	}
	rt_kprintf( " %02x%02x ", *( psrc + 10 ), *( psrc + 11 ) );
	rt_kprintf( "\r\nbody>" );

	psrc = pinfo + 15;
	for( i = 0; i < ( len - 12 ); i++ )
	{
		if( i % 16 == 0 )
		{
			rt_kprintf( "\r\n" );
		}
		rt_kprintf( "%02x ", *psrc++ );
	}
	rt_kprintf( "\r\n>dump end\r\n" );


/*直接处理收到的信息，根据ID分发，直接分发消息*/

	psrc	= pinfo + 3;
	id		= ( *psrc << 8 ) | *( psrc + 1 );

	for( i = 0; i < sizeof( handle_rx_msg ) / sizeof( HANDLE_JT808_RX_MSG ); i++ )
	{
		if( id == handle_rx_msg [i].id )
		{
			handle_rx_msg [i].func( linkno, psrc );
			flag_find = 1;
		}
	}
	if( !flag_find )
	{
		handle_rx_default( linkno, psrc );
	}
}

/*
   处理每个要发送信息的状态
   现在允许并行处理吗?

   2013.06.08增加多包发送处理
 */

static MsgListRet jt808_tx_proc( MsgListNode * node )
{
	MsgListNode			* pnode		= ( MsgListNode* )node;
	JT808_TX_NODEDATA	* pnodedata = ( JT808_TX_NODEDATA* )( pnode->data );
	int					i;
	rt_err_t			ret;

	if( node == RT_NULL )
	{
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == IDLE )                      /*空闲，发送信息或超时后没有数据*/
	{
		if( pnodedata->retry >= jt808_param.id_0x0003 ) /*超过了最大重传次数*/                                                                     /*已经达到重试次数*/
		{
			/*表示发送失败*/
			pnodedata->cb_tx_timeout( pnodedata );      /*调用发送失败处理函数*/
			return MSGLIST_RET_DELETE_NODE;
		}
		/*要判断是不是出于GSM_TCPIP状态,当前socket是否可用*/
		if( gsmstate( GSM_STATE_GET ) != GSM_TCPIP )
		{
			return MSGLIST_RET_OK;
		}
		if( connect_state.server_state != CONNECTED )
		{
			return MSGLIST_RET_OK;
		}

		if( pnodedata->multipacket == 0 )   /*单包发送*/
		{
			/*在这添加消息头?,动态分配如何解决*/

			ret = socket_write( pnodedata->linkno, pnodedata->tag_data, pnodedata->msg_len );
			if( ret == RT_EOK )             /*发送成功等待中心应答中*/
			{
				pnodedata->tick = rt_tick_get( );
				pnodedata->retry++;
				pnodedata->timeout	= pnodedata->retry * jt808_param.id_0x0002 * RT_TICK_PER_SECOND;
				pnodedata->state	= WAIT_ACK;
				rt_kprintf( "send retry=%d,timeout=%d\r\n", pnodedata->retry, pnodedata->timeout * 10 );
			}else /*发送数据没有等到模块返回的OK，立刻重发，还是等一段时间再发*/
			{
				pnodedata->retry++; /*置位再次发送*/
				total_send_error++;
				rt_kprintf( "total_send_error=%d\r\n", total_send_error );
			}
		}else
		{
		}

		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == WAIT_ACK ) /*检查中心应答是否超时*/
	{
		if( rt_tick_get( ) - pnodedata->tick > pnodedata->timeout )
		{
			pnodedata->state = IDLE;
		}
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == ACK_OK )
	{
		return MSGLIST_RET_DELETE_NODE;
	}

	return MSGLIST_RET_OK;
}



/*808连接处理*/
static void jt808_socket_proc( void )
{
	T_GSM_STATE			state;
	static rt_tick_t	server_heartbeat_tick	= 0;
	static rt_tick_t	auth_heartbeat_tick		= 0;

/*
检查是否允许gsm工作
中间的时候关闭连接
*/
	if( connect_state.disable_connect )
	{
		return;
	}

/*检查GSM状态*/
	state = gsmstate( GSM_STATE_GET );
	if( state == GSM_IDLE )
	{
		gsmstate( GSM_POWERON );                /*开机登网*/
		return;
	}
/*控制登网*/
	if( state == GSM_AT )                       /*这里要判断用那个apn user psw 登网*/
	{
		if( connect_state.server_index % 2 )    /*用备用服务器*/
		{
			ctl_gprs( jt808_param.id_0x0014, \
			          jt808_param.id_0x0015, \
			          jt808_param.id_0x0016, \
			          1 );
		}else /*用主服务器*/
		{
			ctl_gprs( jt808_param.id_0x0010, \
			          jt808_param.id_0x0011, \
			          jt808_param.id_0x0012, \
			          1 );
		}
		return;
	}
/*控制建立连接*/
	if( state == GSM_TCPIP )                                /*已经在线了*/
	{
		if( connect_state.server_state == CONNECT_IDLE )
		{
			if( connect_state.server_index % 2 )            /*连备用服务器*/
			{
				ctl_socket( 1, 't', jt808_param.id_0x0017, jt808_param.id_0x0018, 1 );
			}else /*连主服务器*/
			{
				ctl_socket( 1, 't', jt808_param.id_0x0013, jt808_param.id_0x0018, 1 );
			}
			connect_state.server_state = CONNECT_PEER;      /*此时gsm_state处于 GSM_SOCKET_PROC，连完后返回 GSM_TCPIP*/
			return;
		}

		if( connect_state.server_state == CONNECT_PEER )    /*正在连接到服务器*/
		{
			if( socketstate( SOCKET_STATE ) == SOCKET_READY )
			{
				connect_state.server_state = CONNECTED;
			}else /*没有连接成功,切换服务器*/
			{
				connect_state.server_index++;
				connect_state.server_state = CONNECT_IDLE;
			}
		}

		if( connect_state.server_state == CONNECTED ) /*链路维护心跳包*/
		{
			/*判断当前链接是否异常*/
			if(socketstate(SOCKET_STATE)==CONNECT_CLOSE) /*链接被挂断，是主动挂断还是网络原因*/
			{
				connect_state.server_state=CONNECT_IDLE;/*还是在cb_socket_close中判断*/
				return;
			}
			if( server_heartbeat_tick )
			{
				/*要发送心跳包*/
				if( ( rt_tick_get( ) - server_heartbeat_tick ) >= ( jt808_param.id_0x0001 * RT_TICK_PER_SECOND ) )
				{
				}
			}else
			{
				/*重新拨号，发送鉴权命令或注册命令*/
				rt_kprintf( "auth\r\n" );
				//jt808_tx(0x0102,"012345",6);  /*这个简化的指令好像不能执行，基本函数*/
				jt808_add_tx_data( 1, TERMINAL_CMD, 0x0102, 6, -1, RT_NULL, RT_NULL, "012345" );
				server_heartbeat_tick = rt_tick_get( ); /*首次用保留当前时刻*/
			}
			return;                                     /*直接返回，不连ICCARD*/
		}

		
		if( connect_state.server_state == CONNECT_CLOSE ) /*链接关闭，区分主动还是被动关闭*/
		{
			
			
